# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al

/Users/lhinkesjones/flatiron/dc_ds_04_22_19/module_1/day_4_lecture_1_manipulating_with_pandas
total 88
drwxr-xr-x   9 lhinkesjones  staff    288 Apr 25 10:02 .
drwxr-xr-x  14 lhinkesjones  staff    448 Apr 25 09:53 ..
drwxr-xr-x   3 lhinkesjones  staff     96 Apr 25 10:02 .ipynb_checkpoints
-rw-r--r--   1 lhinkesjones  staff     95 Apr 25 09:53 ds_chars.csv
-rw-r--r--   1 lhinkesjones  staff  11328 Apr 25 09:53 heart.csv
drwxr-xr-x   4 lhinkesjones  staff    128 Apr 25 09:53 images
-rw-r--r--   1 lhinkesjones  staff  16603 Apr 25 10:02 manipulating_data_with_pandas.ipynb
-rw-r--r--   1 lhinkesjones  staff   3297 Apr 25 09:53 pre_process_animal_shelter_data.py
-rw-r--r--   1 lhinkesjones  staff    130 Apr 25 09:53 states.csv

In [2]:
import pandas as pd
uci = pd.read_csv('heart.csv')

In [15]:
uci[0:10]

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [4]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [5]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [6]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

In [7]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [8]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [12]:
uci.ca.mean()

0.7293729372937293

#### The Axis Variable

In [ ]:
uci.sum() # Try [shift] + [tab] here!

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [14]:
uci['age'].value_counts().head()

58    19
57    17
54    16
59    14
52    13
Name: age, dtype: int64

$\bf{\rightarrow Exercise: What\ are\ the\ different\ values\ for\ restecg?}$

In [16]:
uci.restecg.value_counts()[0:10]

1    152
0    147
2      4
Name: restecg, dtype: int64

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [17]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [50]:
animal_outcomes.info()
#animal_outcomes.describe()
#dogs = animal_outcomes[animal_outcomes["Animal Type"]=="Dog"]
#print(dogs[dogs["Outcome Type"]=="Adoption"].Breed.value_counts())
#print(dogs["Outcome Type"].value_counts())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98865 entries, 0 to 98864
Data columns (total 12 columns):
Animal ID           98865 non-null object
Name                68333 non-null object
DateTime            98865 non-null object
MonthYear           98865 non-null object
Date of Birth       98865 non-null object
Outcome Type        98856 non-null object
Outcome Subtype     44828 non-null object
Animal Type         98865 non-null object
Sex upon Outcome    98863 non-null object
Age upon Outcome    98862 non-null object
Breed               98865 non-null object
Color               98865 non-null object
dtypes: object(12)
memory usage: 9.1+ MB

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [51]:
def successor(x):
    return x + 1

In [54]:
uci.head()
#uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [56]:
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [57]:
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

$\bf{\rightarrow Exercise: Use\ an\ anonymous\ function\ to\ turn\ the\ entries\ in\ age\ to\ strings}$

In [58]:
# Your code here!
uci['age'].map(lambda x: str(x))[0:10]

0    63
1    37
2    41
3    56
4    57
5    57
6    56
7    44
8    52
9    57
Name: age, dtype: object

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [65]:
new_names = ['id', 'name', 'date', 'monthyear', 'dob', 'outcome', 'outcome_s', 'animal', 'sex', 'age', 'breed', 'color']
animal_outcomes.columns = new_names

In [76]:
animal_outcomes.dob = pd.to_datetime(animal_outcomes.dob, format="%m/%d/%Y")

In [97]:
animal_outcomes["date"][0].strftime("%Y")

'2019'

In [94]:

#animal_outcomes.DateTime = animal_outcomes.DateTime.map(lambda x: x[:10])
#animal_outcomes.head()
animal_outcomes.date = pd.to_datetime(animal_outcomes.date, format="%m/%d/%Y")

In [111]:
animal_outcomes["year"] = 0
animal_outcomes["year"] = animal_outcomes["age"].map(lambda x: float(x.days/365))

In [88]:
animal_outcomes.age = animal_outcomes.date - animal_outcomes.dob

In [ ]:
animal_outcomes["year"] = animal_outcomes["age"].strftime("%")/365

In [112]:
animal_outcomes.head()

,id,name,date,monthyear,dob,outcome,outcome_s,animal,sex,age,breed,color,year
0,A793392,NaN,2019-04-24,04/24/2019 09:37:00 PM,2019-04-22,Transfer,Partner,Cat,Intact Male,2 days,Domestic Shorthair Mix,White/Black,0.005479
1,A793087,*Jeepers,2019-04-24,04/24/2019 07:04:00 PM,2017-04-19,Adoption,NaN,Dog,Neutered Male,735 days,Harrier Mix,Black/Tricolor,2.013699
2,A793417,Diamond,2019-04-24,04/24/2019 07:04:00 PM,2018-04-24,Return to Owner,NaN,Dog,Spayed Female,365 days,Pit Bull Mix,Chocolate/White,1.000000
3,A793416,NaN,2019-04-24,04/24/2019 07:00:00 PM,2019-02-24,Euthanasia,Rabies Risk,Other,Unknown,59 days,Raccoon Mix,Black/White,0.161644
4,A772415,Sky,2019-04-24,04/24/2019 06:48:00 PM,2018-04-12,Adoption,Foster,Dog,Spayed Female,377 days,Border Collie Mix,Sable,1.032877

In [125]:
animal_outcomes.groupby("animal").mean()

               year
animal
Bird       1.408857
Cat        1.505525
Dog        2.815750
Livestock  1.193242
Other      1.272231

In [102]:
animal_outcomes["year"] = 0
animal_outcomes["year"].dtype

dtype('int64')

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [113]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [114]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [116]:
uci.groupby('sex').get_group(0).tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Aggregating

In [117]:
uci.groupby('sex').std()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,9.409396,0.972427,19.311119,65.088946,0.332455,0.557150,20.047969,0.422503,1.119844,0.593736,0.881026,0.441290,0.435286
1,8.883803,1.059064,16.658246,42.782392,0.366955,0.510754,24.130882,0.484505,1.174632,0.627378,1.074082,0.659949,0.498626

$\bf{\rightarrow Exercise: Tell\ me\ the\ average\ cholesterol\ level\ for\ those\ with\ heart\ disease.}$

In [ ]:
# Your code here!

### Apply to Animal Shelter Data

Lastly, use a groupby to show the average age of the different kinds of animal types. Hint: use `.unique()` on a column to see what unique values are in the column.

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [118]:
uci.pivot(values = 'sex', columns = 'target').tail(10)

target    0   1
293     1.0 NaN
294     1.0 NaN
295     1.0 NaN
296     0.0 NaN
297     1.0 NaN
298     0.0 NaN
299     1.0 NaN
300     1.0 NaN
301     1.0 NaN
302     0.0 NaN

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [132]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [134]:
toy1.join(toy2.set_index('age'), on = 'age',
          lsuffix = '_A', rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

### `.merge()`

In [129]:
ds_chars = pd.read_csv('ds_chars.csv', index_col = 0)
ds_chars.head()

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [130]:
states = pd.read_csv('states.csv', index_col = 0)
states.head()

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

In [128]:
ds_chars.merge(states, left_on='home_state', right_on = 'state',
               how = 'inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

### `pd.concat()`

$\bf{\rightarrow Exercise: Look\ up\ the documentation\ on\ pd.concat}$ (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) $\bf{and\ use\ it\ to\ concatenate\ ds\_chars\ and\ states.}$
<br/>
$\bf{Your\ result\ should\ still\ have\ only\ five\ rows!}$

In [155]:
pd.concat([ds_chars, states])

/Users/lhinkesjones/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      HP     capital home_state    name   nickname state
0  200.0         NaN         WA    greg        NaN   NaN
1  200.0         NaN         WA   miles        NaN   NaN
2  170.0         NaN         TX    alan        NaN   NaN
3  300.0         NaN         DC  alison        NaN   NaN
4  200.0         NaN         TX  rachel        NaN   NaN
0    NaN     Olympia        NaN     NaN  evergreen    WA
1    NaN      Austin        NaN     NaN      alamo    TX
2    NaN  Washington        NaN     NaN   district    DC
3    NaN    Columbus        NaN     NaN    buckeye    OH
4    NaN       Salem        NaN     NaN     beaver    OR

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [ ]:
pd.melt(ds_full, id_vars=)

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [140]:
intake.columns = ["id", "name", "date", "month-year", "location", "intake_type", "intake_condition", "animal", "intake_sex", "intake_age", "breed", "color"]

In [150]:
intake.date = intake.date.map(lambda x: pd.to_datetime(x[:10]))

In [151]:
intake.head()

,id,name,date,month-year,location,intake_type,intake_condition,animal,intake_sex,intake_age,breed,color
0,A793441,NaN,2019-04-25,04/25/2019 11:50:00 AM,4902 Scarsdale Dr in Austin (TX),Stray,Normal,Dog,Unknown,2 years,Jack Russell Terrier Mix,Tricolor
1,A793444,NaN,2019-04-25,04/25/2019 11:50:00 AM,4902 Scarsdale Dr in Austin (TX),Stray,Normal,Dog,Unknown,2 years,Rat Terrier Mix,Tan
2,A793440,NaN,2019-04-25,04/25/2019 11:33:00 AM,Players Path in Austin (TX),Stray,Normal,Dog,Neutered Male,5 years,Chihuahua Shorthair Mix,Tan/Black
3,A793439,Barney,2019-04-25,04/25/2019 11:26:00 AM,4204 Manchaca Road in Austin (TX),Stray,Normal,Dog,Neutered Male,1 year,Labrador Retriever Mix,Black/White
4,A793443,NaN,2019-04-25,04/25/2019 11:13:00 AM,Heatherwilde in Austin (TX),Stray,Normal,Dog,Intact Female,9 months,Siberian Husky Mix,Brown/White

In [152]:
all = intake

In [157]:
animal_outcomes.dtypes

id                    object
name                  object
date          datetime64[ns]
monthyear             object
dob           datetime64[ns]
outcome               object
outcome_s             object
animal                object
sex                   object
age          timedelta64[ns]
breed                 object
color                 object
year                 float64
dtype: object

In [158]:
all.dtypes

id                          object
name                        object
date                datetime64[ns]
month-year                  object
location                    object
intake_type                 object
intake_condition            object
animal                      object
intake_sex                  object
intake_age                  object
breed                       object
color                       object
dtype: object

In [161]:
all = all.merge(animal_outcomes, left_on="id", right_on="id", how="inner")

In [162]:
all.head()

,id,name_x,date_x,month-year,location,intake_type,intake_condition,animal_x,intake_sex,intake_age,...,monthyear,dob,outcome,outcome_s,animal_y,sex,age,breed_y,color_y,year
0,A766326,Snow,2019-04-25,04/25/2019 11:13:00 AM,Heatherwilde in Austin (TX),Stray,Normal,Dog,Intact Male,3 years,...,06/16/2018 12:24:00 PM,2016-02-06,Return to Owner,NaN,Dog,Intact Male,861 days,Siberian Husky Mix,White/White,2.358904
1,A766326,Snow,2019-04-25,04/25/2019 11:13:00 AM,Heatherwilde in Austin (TX),Stray,Normal,Dog,Intact Male,3 years,...,02/07/2018 09:32:00 PM,2016-02-06,Return to Owner,NaN,Dog,Intact Male,732 days,Siberian Husky Mix,White/White,2.005479
2,A766326,Snow,2018-06-14,06/14/2018 07:08:00 AM,I-35 & Howard Ln in Austin (TX),Stray,Normal,Dog,Intact Male,2 years,...,06/16/2018 12:24:00 PM,2016-02-06,Return to Owner,NaN,Dog,Intact Male,861 days,Siberian Husky Mix,White/White,2.358904
3,A766326,Snow,2018-06-14,06/14/2018 07:08:00 AM,I-35 & Howard Ln in Austin (TX),Stray,Normal,Dog,Intact Male,2 years,...,02/07/2018 09:32:00 PM,2016-02-06,Return to Owner,NaN,Dog,Intact Male,732 days,Siberian Husky Mix,White/White,2.005479
4,A766326,Snow,2018-02-06,02/06/2018 04:47:00 PM,12900 Dessau Road in Austin (TX),Stray,Normal,Dog,Intact Male,2 years,...,06/16/2018 12:24:00 PM,2016-02-06,Return to Owner,NaN,Dog,Intact Male,861 days,Siberian Husky Mix,White/White,2.358904

In [135]:
intake = pd.read_csv("https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD") #code here

## Assessment & Reflection